#+TITLE: textX
#+EXPORT_FILE_NAME: index.html
#+SETUPFILE: ../../courses-startup.org


** Provera i vizualizacija meta-modela

- textX će pri parsiraju gramatike prijaviti sintaksne greške.
- Ako želimo možemo proveriti gramatiku u toku razvoja:

  #+BEGIN_SRC bash :results output
  textx check hello.tx
  #+END_SRC

  #+RESULTS:
  : /home/igor/repos/igordejanovic.github.io/courses/tech/textX/hello.tx: OK.

- U slučaju greške biće prijavljena tačna lokacija.

  #+BEGIN_SRC
  Error in meta-model file.
  Expected 'abstract_rule_ref' at position (6, 9) => ':   name |*= /[^,]*/ '.
  #+END_SRC

- ili vizualizovati

  #+BEGIN_SRC bash :results output
  textx list-generators
  #+END_SRC

  #+RESULTS:
  : any -> dot                    textX                         Generating dot visualizations from arbitrary models
  : textX -> dot                  textX                         Generating dot visualizations from textX grammars
  : textX -> PlantUML             textX                         Generating PlantUML visualizations from textX grammars
  
  #+BEGIN_SRC bash :results output
  textx generate hello.tx --target dot
  #+END_SRC

  #+RESULTS:
  : Generating dot target from models:
  : /home/igor/repos/igordejanovic.github.io/courses/tech/textX/hello.tx
  : -> /home/igor/repos/igordejanovic.github.io/courses/tech/textX/hello.dot
  :    To convert to png run "dot -Tpng -O hello.dot"


